from time import sleep
import sys
import os
import hashlib
import keyboard

BLESSINGS = {'oren':'''
You are amazing student.
It way my pleasure to teach you.
You are smart and huble and it's fun to be around you.
Keep doing with the hard work.''',
'eliya':'''
You truly are an exceptional student.
Your intelligence and assertiveness make you stand out.
It was an absolute pleasure to teach you this year.

Keep up the remarkable work and embrace your strengths.
The future holds great success for you!
''',
'ron':'''
Your brilliance shines brightly in the classroom.
Your ability to do any mission with success sets you apart.
I am grateful to have had the opportunity to teach such a remarkable student like you.

Keep pushing yourself to new heights and know that you have the potential to achieve anything you set your mind to.
''',
'itai':'''
You are super intelligent students.
It's was my pleasure to teach you.
You are talented and friendly and it's fun to around you.

Stay as you are!
''',
'yarden':'''
You are amazing strong student.
Your charisma attracts everyone near you.

Stay friendly and amazing as you are.
Big future is ahead of you!
''',
'shahar':'''
You are super friendly student - this is why everybody want to be around you.
I'm proud of the progress you did - 
At the beging of the year I could see you facing technological chanllenge and I'm happy to see now you overcome that challenge.

You are smart and happy person - stay like that!
''',
'daniel':'''
It was my pleasure to be your teacher.
You are humble and intelligent stuent.

Big future ahead of you -
Stay as you are!
''',
'lior':'''
I'm proud of the hard work you did this year.
I know it wasn't easy but you did it and you finished your first year.

You are super smart and I'm happy you were in my class.
''',
'avi':'''
I happy you were in my class this year.
You are humble and super intelligent student.

Stay as you are - you qualities will take you far!
''',
'yonatan':'''
You adds color to the class.
Your unique character makes it fun to be around you.

I had the pleasure to have you in my class - stay awesome as you are!
''',
'ido':'''
I'm proud of the way you did this year.
No matter what you didn't give up.

You are good friend and intelligent.
Good luck next year!
'''
}

IDS = {"oren":b'$\x06Z\xd4\xaa\xbd\xedG{\xaf\x8d\xe2\xfb\xee\xfbt',
       "daniel":b'\x1c\x90\x07\xb1\x19\x1fV\xca\xf9\xc8~S\x99\xf2\xae\x8e',
       "yonatan":b'$\xf18\xa3P\x17\xc5\x05+\xd1\xe1KK}\x90\xdc',
      "yehonatan":b'$\xf18\xa3P\x17\xc5\x05+\xd1\xe1KK}\x90\xdc',
       "avi":b'\x18\xc3m\x15\xed\xa4\xc3\xa1`\x86]\x11#\x7fC\xe3',
       "ido":b'z\xe4N\xd8/\x84r\xffV\xc0\x95\x90Ga\xb2\xa8',
       "edo":b'z\xe4N\xd8/\x84r\xffV\xc0\x95\x90Ga\xb2\xa8',
      "yarden":b'\xb9v\xcc\xd5\x0b\x9f\x0f\xcb\xfb\x86\xf48\xf6y\xb7\xae',
      "shahar":b'H\xe9\x1c\xe5\xc94\x14rE\xfd\xe8\x8d\x92\x92|a',
      "shachar":b'H\xe9\x1c\xe5\xc94\x14rE\xfd\xe8\x8d\x92\x92|a',
      "itai":b'\xc2\xaf}\x95\xa2\x04\xb8_*\xa7\xd6\x91W\x90\x0c\xd6',
      "itay":b'\xc2\xaf}\x95\xa2\x04\xb8_*\xa7\xd6\x91W\x90\x0c\xd6',
      "lior":b'\xa8*\xd3{T\xbd\xff`P\xb5\xa7m;\xf2\x91 ',
      "eliya":b'2mMOY\xdf\xee\x83\xb7\x8a\xddP\x16\xc2\xad\xd6',
      "elia":b'2mMOY\xdf\xee\x83\xb7\x8a\xddP\x16\xc2\xad\xd6',
      "ron":b'4\xe0\xecx\xd37\xfc\xcc\x1e\xef\xe0\xe8\xa5/\x86('
       }

HEB_BLESS = {"oren":'''
אורן היקר,
היה לי כיף ללמד אותך השנה.
אתה אדם נעים וצנוע שכיף להיות לידו.

עבדת קשה השנה וניכר שלמדת והתפתחת.
תמשיך עם העבודה הקשה ואין לי ספק שבסוף תשתלם.
המון בהצלחה בהמשך!

תומר אליאל.
רשתות, מגשימים, 2023.
''',
'eliya':'''
אליה היקרה,
אין ספק שאת מוסיפה לכיתה גוון ייחודי ויפה.
הפרפקציוניזם שלך והמוטיבציה בשמיים מעוררים קנאה והשראה - תשמרי על תכונות אלו, אין ספק שהן יביאו אותך לגדולות.

תישארי ייחודית וחריפה כמו שאת,
דומיננטית ובולטת.
בהערכה רבה,
תומר אליאל.
רשתות, מגשימים, 2023.
''',
'ron':'''
רון היקר,
אתה מקצוען אמיתי! תכונה שאני מעריך מאוד בך!
רואים שיש בך תשוקה למקצוע - תן לתשוקה הזו להוביל אותך ותגיע רחוק!

אתה חבר טוב ומוסיף לכיתה גוון ייחודי.
האישיות שלך אוספת את כולם סביבך.
אני מעריך את העבודה שעשית השנה.
בהצלחה בהמשך!
תומר אליאל.
רשתות, מגשימים, 2023.
''',
'itay':
'''
שולמןןן!!!
דבר ראשון אני רוצה להגיד לך שאני גאה על הקפיצה המטורפת שעשית השנה!
הסמסטר הראשון הלך לך טוב אך הקסם האמיתי התחיל בסמסטר ב' - 
פתאום גיליתי אדם דומיננטי ואיטילגנט - 
הפצצת בחומר המקצועי וגם חברתית הוספת צבע לכיתה.

אני מעריך את העבודה הקשה שלך השנה!
אין לי ספק שתצליח בעתיד.
תומר אליאל.
רשתות, מגשימים, 2023.
''',
'yarden':'''
שחר היקרה... סליחה סליחה...
ירדן היקר!
האישיות שלך צבעונית וממגנטת - אתה חריף ושנון וכיף לדבר איתך.
השנה עשית קפיצה משמעותית בין סמסטר א' לסמסטר ב' כאשר לקראת סוף השנה כבר היה ברור שאתה מהחזקים בכיתה.

היה לי הכבוד שתהיה בכיתה שלי.
המון בהצלחה בהמשך.
תומר אליאל.
רשתות, מגשימים, 2023.
''',
'shahar':'''
ירדן היקר...אההה סליחה...
שחר היקרה!
אני זוכר בשיעור הראשון תלמידה מעט מפוחדת ולחוצה.
כזאת שכשאמרתי לכולם לפתוח תיקייה במחשב הסתכלה אליי בחוסר ביטחון ולא ידעה כל כך מה אני רוצה.
היום, אחרי שנה אני רואה תלמידה תותחית וסקרנית - כזו שיודעת בדיוק איך הרשת עובדת ואיך לתכנת בפייתון.
כזו שהידע שלה כבר היום כנראה מתעלה על הידע של 90% מהאנשים באוכלוסיה.
אני גאה בך על הדרך המשמעותית שעשית!

המוטיבציה שלך מעוררת השראה - תשמרי עליה!
בהערכה רבה והצלחה בהמשך,
תומר אליאל.
רשתות, מגשימים 2023.
''',
'daniel':'''
דניאל היקר!
אין דבר שאני יותר אוהב מלהגיע לכיתה ולראות אותך מחכה לי שם ראשון או מגיע ביחד איתי ואז אנחנו מנהלים שיחה קצרה על איך הולך בלימודים ובתוכנית.
אתה חניך סופר חכם ועם זאת גם צנוע ומאוד נעים לבריות.
אתה חבר טוב וברור לי שבגלל זה אתה אהוב בכיתה.

הדרך השקטה בה אתה עושה דברים מעוררת הערצה - תמשיך כך!
מאחל לך המון הצלחה בהמשך,
תומר אליאל.
רשתות, מגשימים 2023.
''',
'lior':'''
ליאור היקרה,
אני אפתח בזה שאני גאה בך על הדרך שעשית השנה.
לשלב לימודים בבית הספר ומגשימים זה קשה ולא לכל אחד - אבל אין ספק שעשית את זה ועמדת בזה בגדול!
המוטיבציה שלך להצליח וללמוד מעוררת הערצה!

תמשיכי להתמיד ולחתור להצלחה כמו שעשית השנה ואין לי ספק שתגיעי לגדולות.
מעריך המון,
תומר אליאל.
רשתות, מגשימים 2023.
''',
"avi":'''
אבי היקר!
תעבוד קשה בשקט, ההצלחה כבר תעשה את הרעש!
זה המשפט שמבחינתי מתאר אותך - עבדת קשה מאוד ושמרת כל הדרך על ענווה מעוררת הערצה.
עכשיו סיימת שנה בהצלחה ואתה קוצר את הפירות.

אתה חבר טוב ואדם נעים שכיף להיות סביבו ולדבר איתו.
אני שמח והיה לי העונג שהיית בכיתה שלי.
מאחל לך המון הצלחה בהמשך,
תומר אליאל.
רשתות, מגשימים 2023.
''',
"yehonatan":'''
יונתן היקר!
אני גאה בך בטירוף על הדרך שעשית השנה - 
כל פעם כשהיה קצת קשה הפקת לקחים ויצאת משופר וחזק יותר
בסוף השנה אני מסתכל ואני רואה חניך מעולה עם יכולות גבוהות שלא מפסיק להפתיע.

אתה חבר טוב ואדם נעים. כיף להיות סביבך ונהנתי מאוד מחברתך.
אני בטוח שתגיע רחוק!
תומר אליאל.
רשתות, מגשימים 2023.
''',
"ido":'''
עידו היקר,
עשית דרך משמעותית מאוד השנה.
עבדת קשה מאוד, לא תמיד זה היה קל וראיתי איך למרות הכל אתה לא מוותר וממשיך.
לבסוף אתה קוצר את הפירות וסיימת את השנה בהצלחה מרובה.

אתה חבר טוב וגבר אמיתי,
אני שמח שאתה בכיתה שלי וזכיתי ללמד אותך השנה.
תשמור על התכונות הטובות שבך והן יובילו אותך רחוק.
מעריך המון,
תומר אליאל.
רשתות, מגשימים 2023.
''',
"edo":'''
עידו היקר,
עשית דרך משמעותית מאוד השנה.
עבדת קשה מאוד, לא תמיד זה היה קל וראיתי איך למרות הכל אתה לא מוותר וממשיך.
לבסוף אתה קוצר את הפירות וסיימת את השנה בהצלחה מרובה.

אתה חבר טוב וגבר אמיתי,
אני שמח שאתה בכיתה שלי וזכיתי ללמד אותך השנה.
תשמור על התכונות הטובות שבך והן יובילו אותך רחוק.
מעריך המון,
תומר אליאל.
רשתות, מגשימים 2023.
'''}



header = '''
   ______________________________
 / \  Dear %s,%s\.
|   |                            |.'''
max_header_length = 21

first_line = " \_ | %s|."
line_max_length = 27

body = "    | %s|."
footer = '''    |                            |.
    | Yours,                     |.
    | Tomer Eliel                |.
    | MAGSHIMIM-NETWORK-2023     |.
    |   _________________________|___
    |  /                            /.
    \_/____________________________/.
'''


def create_ascii_frame(text, student_name):
    frame = [header % (student_name, " " * (max_header_length - len(student_name)))]
    lines = text.split('\n')
    if len(lines[0]) > line_max_length:
        first_line_words = lines[0].split(" ")
        new_first_line = ""
        while len(new_first_line) < line_max_length and len(first_line_words) > 0:
            new_first_line += first_line_words[0]
            new_first_line += " "
            first_line_words = first_line_words[1:]
        up_lines = [" ".join(first_line_words)]
        up_lines.extend(lines[1:])
        lines = up_lines
        frame.append(first_line % (new_first_line[:-1]))
    else:
        frame.append(first_line % (lines[0] + " " * (line_max_length - len(lines[0]))))

    for line in lines:
        while len(line) > line_max_length:
            sub_line = line[:line_max_length]
            frame.append(body % sub_line)
            line = line[line_max_length:]
        frame.append(body % (line + " " * (line_max_length - len(line))))

    frame.append(footer)
    return '\n'.join(frame)




ART = '''
        
                                                                                                                                                              
                                                                        ,*(((/(///,*/*/*                                                              
                                                               ,*(((((((((((/(///((/(/(//////////,.,/                                                 
                                               ((( (((((((((((((((/(/(//////////*///////////////////                                                  
                                           ((((###((((((((((((//////******************/////***///(////////*,.                                         
                                       .##########((////////*/**/***********************,***/***//////////////,*,,/.                                  
                                     ,/#####((((((///////*/*****************************,,******//*/***//////((/(/////*/                              
                                  #*#######((((/#/*/************************,**************,*,**,,****/***///////(//((//                              
                               ((######(((((/////*//*/************************,*,*,*****,*,*,,*,*,****/*******/**////(/(///                           
                            **#####%#(#((((///*//////**********************,******,*******,,,**,,,,,,**,**********//////(///                          
                           *%#######((((((/////***/**/**************************,****,,,*******,,,,,,,,****,*******////(((/**,                        
                          %%%%##%#((((((//////*//**/*/***********************//////*/**************,,,,***************//((/(((//                      
                         %%%%%###((#((//////(////(/(///////////////////////////////////////////*******************/**//////(((((//*                   
                       (#%%%%##%%#((((((/(((((((((((((/((((((((((((/((///////((((((((((((((((///////////////******,*//*//((((((((*,*                  
                       #%#%%%%###((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((/(/(////****///////(((((((/                  
                      %%%%%####(((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((/////////(/(((((/,                  
                     *%%%%%#########(#((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((//*/////(((((,                  
                    %%%%&&%############((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((///*/((((((                  
                   ,%%%%%%%%###########(((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((########(((/*//(((((.                 
                    %%%#%#%%#############(##((((#######((((((((((((((((((((((((((((((((((((((((((((((((((((((((((###########///(((( (                 
                   *%%%%%#%%###########################(##((#((###(((#((((((((((((((((((((((((((((((#(((#(((((((###(#########//((((((                 
                   *%%%%%%%#######################################(((##(((((((((((((((########(##((#(#########################(/((((                  
                   %%&%%%%%%####################################((((((((((((((((((((((((((#(((((((((##(########################(((((.                 
                  %#%%%%%#%%%%#########################(((((((####(((((((#(((((((((((((((((((((((((((((########################(((((((                
                  ##%##%%%%%%%%#%%##################(((#(((((((((((((((((##((((((((((((((((((((((((((((((#((####################(((((/.               
                  *####%%%%%%%##%###############((#(#((###((((((((((#((((###########(((((((((((((((((((((((######################((((,                
                   ####%%%%%%%%###########((((((((((((((((((((((((((####((((((((#((#####(((((((((((((((((((((((#################((((.,                
                  ###%#%%%%%%%%####((((((///(/((((((((((((((((((((((((((((((((((((((###(((((((((((((/////////((((((((##(####%####((((,                
                  ####%%%%%%%%#((((/////////*********///((((((((((((((((((((((((((((((((((((((//////****,,*,,********///(((##%###((((                 
                  #####%%%%%#((///////***********,**,****//////////(((((((((((((((((((/////(///***,,,,,,,,,,,,,**********//(#%###((((                 
                  (###%%%%###((/////*/***********,,,,*****///***/**////(((((((((///////*/*//***,,,,,,,,,,,**************/////(%##(((                  
                  ###%%&%%(((///(/////////////*/************//***//**/(((((((((((/**//*******,,,,,,********//////////////////(/(#((((                 
                   ###%%##(#((((((((((((///////////////********//*////((((((((((((/***/***************////////////////(///((//((((((                  
                   ##%%%##(###(((((/(//////////////////////////////((((((###(((#(((/**************////*///*//////////((((((((((#((((                  
                   ##%%%#%%%#(((//(/***,,,,,,,**,,,*,,,,****////(((((((#(((##(((((((/*********,,,,,,,,,,,,,,,,,..,***//((((((((#((((                  
                   #%%%%%%%%#((/**,,**/////((((((///************/(#((##((##((####((((/***,,****,,,*///(((/(/(//***,,,,,*/(((((((###(                  
                  ##%%%%%%%#(/******/(((**////(***((//*****/////((####(###((((((####(((/****,,,**//((**////*,,(((((*,,,,,*/((((###((                  
                  ##%&%%%##(/******/(((/**/,.,.****/////*//*///(######(###((##(########(//*******///,,*..,.,,,,((##*,,,**,*/((((#%#(                  
                  ##&&%%###(///(##((/////////////////**//////(#((###%######(#((######((##((/**/****/**/**,,,,,***/*////****/((((#%#(                  
                  #%&&%%##((((#####((((((((///////////////(((##############((#############((((////////////****////(((((((////(((#%%(                  
                  %&&%%%###########((((((((((((((((/////((((#############((((((((######((((((((((//**/////(///(((((((((##(((((((##%#(                 
                 %%&&%%###########(((((((///////(((((((((((((###%%#######(((((((########((/((((((((((/(/////////(((((((###((((((##%#(                 
                &%&&&%%########(((((((((((((((((((((((((((((/(##########((((((((((#####(((///((((((((((((((((((((((((##(#####((####%(,                
               &#(&&%%%#%#########((((((((((((((((((((((((//(###%#%###((((((((((((#####((((**//((((((((((((((((((((###########((###%(#(               
               %/(&&%%%%%########(#((((((((((((((((((((((//#####%######(((((((((((((####(##(/*///((((((((((((((((((##################*/,              
              %#/(&&%%%%%#%%########(#####((##(((((((((//#####%%%%%##((((((((((((((((########(**//(((((((((((((((((##(###############*//              
              #((#&&%%%%%%%%##########(((((((((((((((///#%%%%%%%%###((((((((/////((((((((#####(***///((((((((((((((((#(#############%*//              
              #(/%&&%%%%%%%#%#%#####(((((((((((((((//**/######(((((((((((////////////////((((((****///((((((((((((((((##############%///              
              #(#%&&&%%%%%%%%%######((((((((((((((///*///(//*,,,,,,,,*(((/////////,,,,,,,,,*//****,*/////(((((((((((((((#######(####%///              
               #(%&&%%%%%%%%%%###((((((((((((((((//**//////*****////////(///**//******/********//**,*//////((((((((((((((((##########(/.              
              %%(%&&%%%%%%%%%%###(((((((((((((((///*//(/////////***********************/*//////////*,**//////((((((((((((((#(##(#(###(/               
              #%(%&%%%%%%%%%#%####((((((((((((////*//(((//////**,****,,**********,,*****/***///////*****///////((((((((((((((#((#(###((               
              %%%%%%%%%%%%%%%%##(((((((((((((////*//((///*/*//**,*,,,,,,*********,,,,**,**,,**//*/******///////////(((((((((((#((####(                
              *###%%%%%%%%%%%%%##((((((((((/////**//////********,,,,,,*,,********,,,,,,,,,,,,,,*******,**////////////(((((((((((((##((                
               %%#%%%%%%%%%%#%####(((((((((////**//////***/*****,,,,,,,,*,**/********,,,*,,*,,,*,******,**///////////((((((((((((((((/                
               *%%#%%%%%%%%%%#%####((((((((////*/////****,//**///******/////(((((((////////***,***,****,***//////////((((((((((((((//,                
                %%(####%%%%%##%###(((((((////***//*///*//////((/(/////////////////////////////(///***,**,***/////////((((((((((/(/(//                 
                 %#%%##%%%%%%#####(((((////********//((#(((///////***************************///((((/**,,,**////////((((((((((((//(//                 
                 *(###(#%###%%#%%###((((///**,****/###(///***********//////////((/*******,,,******/((/,,*,**////////(((((((((((/////                  
                  #((##(%%%#%###%#((((((////*,***/(%#(/*******/((((((######((######(/((((/*********/(/,*,,***/////////((((((/(**///,                  
                   (#(#(###%#(####((((((///***/**/(#/*******//##%##(#%%%%%###%%%%###(#####////******//,,,,*****////////(((((////***                   
                    (####(####(###((((/////*,,***///******/((#%#####%%%%%%%##%######*(###(/(((*,*****/*,,,****/////////((((/(/*///                    
                     #(##(####((#(((//////**,,**////****............(####*,................   .,*********,**///////////(///(//*/*                     
                     *##(%##%###(((/(//////*,,,*//******.................................. ....,*********,,*/*///////////*//#//*/                     
                      #(#####(#(((#////////**,*////***,..............,.,,...,,,,,,,,........ ..,*********,**/**///////**/*//**//                      
                      ####((#(##(#(////**//***/*//****,.........,,,,,,,,,,,,,,,,,,,,,,,... .....,**,*/***,,*//*///*********//*/*                      
                       ##(###(##(((//////*/*,***//***,.,,......,,,*,*,*,,,,,,,,*,,,,,,,,,.......,***//****,***///**//*****/*(*/,                      
                       *((##(((((/(((///******/////**..,,....,,,***********,,***********,,.......*////***,****///*****,*/**//*/                       
                       ,(#((/##((////////**,,***//(/*,,,,,,..,,***///////**,*************,..,,,,**////***,,,,******,**,*****(*/                       
                       .//(///**//(///**/**,,,***/(//*,,**..,,*****////////**////////****.,******/////**,,,,,******,,,,**,**,**                       
                        /(//(((*/*/(//**/,,,,,**//((/*****/,.,******///////**//////****,..////////(//*****,,.,,***,,,,,,*,,***                        
                         ////((//****//***,,,***//(((/***/**..,,***********/**/*/***,,...,(((/*//////*******,,,*,,,....**,,,**                        
                         (/#*/((/**/(***,*,.,,***/(((///*//,,,,,,,,,,***********,,,,,**,.//((/*//////*****,,,*,,,,,,,,,,*,,,**...,,.                  
                         ,,/(////,*//****,,,,,,*///(/(/////(/,,,********,...,********,,,(((((/*///(//*/*,,,****,,*,*.,,,,,,,,.. .,..,,,,*             
                       /((//***///**//**,,,..,,*///(((///*/(###*****/*****************####//***///(//***,,,,****,*.,,,,,,,,,*,........,,.,,,          
                  #((((/,,.,(/*/**(**/**,...,,,,*//(((///**((#(####(((###((#####((###(((((/,**///(////**,,,,*******,,.,,,,,*/..,.....,,.,,,,,,        
               *((//*,....,.,,#(*/*,**/,,.,.,,,,*//((((///**/(//((#((/((((//((((/(((///(/*//////(/////*,.,.,*****,,,,...,,/*,   .,. .,.....,,,,,      
  ,*/(//((((((((/*,,....  ...,//(********,,.,,,,*///(((////////***///////////////**///////////////////,..,*,**,,/,.,.,...,*,,,,,.,....    ....,.,*****
//******//**/(/*,.....     ../,/**,/**,**,*,*,,,**///((///////////////(///////(((//(//////////*//////,,.,.,***,*,,.,,,,..,,,...,,.......,.,....,*****,
.....,,*///((*....        ...,**/,,,//,*/*,,*/*,,,*////(//////((//(((((((////((((/((////*****///////,,,..,,/****,,..,...,,.........,,..   ..,,,,,,...,
....,*******,...         .../,./**,****,,***,,,,,***/////////*//////////////////////*******///////**,,,,..**,,,,,.,.,..**,........ .,,,   .,. .,,.,,,,
*/////*.......     . ....,*,....**,*,/,,,,**,***,,,,*///////***********************,,*******/*///***,,..,*,,,,,.,... ..*/ ........ .,...      ..,...,,
/****,,,.......   ....,**,....  ,.**,/,*,,,,,****,*****/*******,,,,,,,,,,,,,,,,,,,,,,,*,***///*****,,,,,,,,,,,...... ,*/, .......   .....      .,,.,,.
,,,,,,,,...         .,,,...... .,..,*,,*,,*,*//*,,.,,*,**********,,,,,,,.,,,,*,,,,,,,*,,**/*****,,*.,,,,.,,,...    .,*/*.........   ......      ,...,,
,.......           ,,......    ....,.,*,*,,*,*(,,,,**,,*,,*,***,*,,,,*,,,,,,,,,,,,,,,,,*****,,*,,,,.,,...,,,.,... ,*//*, ....  .     ......     .....,
.....            .,,.......   ....,...***,*,**/,*,,,**,*,,*,,,,,,,,.,,,..,,,,,....,,,,**,,,,,,.,,,,...,..,.....,.,*/**,. ...          ......     .....
..              .,......     .....,..,,***,*,*,,*.,,*,*......,,...,,,...,.,..,.,,,,,,,,*,,.,.,.,,,,...,...,.,.,*****,,.      .          ....     .....
            .........         ....... .,****/,,,**,*,,,.,,,,,.,.....,,,,,,,,,,,,,,,,,.,.*,,..,...,,..........***/**,,,.  ..               ...     ....
          ..........        . ..........,**/**,,*,,/,,,,,,.,.,,,,,,,,,,,.*,,.,,.,,,,,,,..,......,......,,..,*******,,.                     ...     ...
       .........         .  .  ... .....,,*****,../,...*.,,,.....,,,,,,,,,.,...,,,,.,,.............  ...,,********,,. .    ..               ...     ..
  .... ........              ...........,,***//*.*,..,.,......,.........,.....,....,............ .  ...,*********,,,  .    .                 ...    ..
....   ......               ... ... ....,,*****/*/**,,,.,.........................,.........      ..,,.*********,,,  .      .                ....    .
... . .....      .....    .....    ......,,*****////*,/**....... ..  . ............. .  . .     ..,,************,,                             ...    
. .......       ....     ....      . ...,,*****////////**,**..... .        .         .       ..,***************,,                               ..    
 .......       ....       .          .. ,,,****///////////****,..,,,,........   ......,...,,*,*****************,          .                     ...   
........    .....           .  .    ... ,,*****///*////////***********,,.,...,*,,*,,,**,*************//*******,          .                       ...  
... ..     .....                     .. .,,****//*/**////////*****/***,*,**********************//**////******           .                             
 .       .......                     ....,,****///*/*/////*/****************************/////////////******.                                        . 
 .        ....                       ... ,,*****//////**///**/******************/*****//////////////*****,                                            
 .      ....            .            ... ,,,***/*/////*///*/***/****////**/**/**/**///////*///*//******.                                              
         .....              .        ... ,,,**//***///*//*/***//*****/**////////*/////*//////*/******                                                 
         ...                          .. .,,****///**////*/***/*///*///////////////////*///******,                                                    
  .     . .                           ... ,,***/****/**/////////////////*//////*///*//*********.                                          .           
        .   .                          ..  ,***********//////*****/**///****//***/*//*//**,.                                                          
                                       ...  ,,*******,**/****/////****////*///*/******/.                                                              
        .                              ...    ,*****////*/****//*/****///*/*******,                                                                   

        '''




def clear():
  os.system('cls')




def bye():
    keyboard.press('f11')
    os.system('color 07')
    clear()
    sys.stdout.flush()  
    print("Press F11 any time to exit full screen!\n")
    print("full screen will be better!, I'll wait for 12 seconds now...")
    sleep(12)
    clear()
    if(input("ARE YOU MAGSHIMIM NETWORK STUDENT? (YES/NO)"+"    ").lower() == "yes"):
        os.system('color 0F')
        clear()
        sleep(1)
        print("Oh GREAT! it's you again....")
        sleep(3)
        clear()
        ans = input("IF YOU ARE REALLY MAGSHIMIM STUDENT - WHO IS THE BEST TEACHER YOU EVER MET?  \n")
        while ans.lower() != "tomer":
          clear()
          if(ans.lower() == "viki" or ans.lower() == "vicki" or ans.lower() == "vicky"):
            ans = input("WRONG ANSWER!\nNice try... Vicky...\nI ASKED\nWHO IS THE BEST TEACHER\nYOU EVER MET?  \n")
          else:
            ans = input("WHAT YOU SAID?!?!?!  WRONG ANSWER!\nI ASKED\nWHO IS THE BEST TEACHER\nYOU EVER MET?  \n")
        clear()
        
        print("Very nice... very nice...\nTomer is the best indeed")
        sleep(5)
        os.system('color A')
        print("WHO DARE TO WAKE ME UP FROM MY SLEEP?!?!\n")
        sleep(4)
        for line in ART.splitlines():
          print(line)
          sleep(0.02)

        sleep(2)
        student = input("\n\nWHO ARE YOU?\n")
        while student.lower() not in STUDENTS.keys():
          student = input("I SAID - WHO ARE YOU???  WHAT IS YOUR NAME????\n")
        clear()
        print("Ohh...")
        sleep(2)
        clear()
        print("Is it really you "+student[0].upper() + student[1:].lower()+"?")
        sleep(3)
        clear()
        print("I guess its time to say goodbye...")
        sleep(4)
        clear()
        #STUDENTS[student.lower()]()
        bless(student.lower())
    else:
        print("YOU HAVE NOTHING TO LOOK FOR HRER - BYE!!!")
        keyboard.press('f11')
        sleep(6)
        os.system('color 07')
        os.system('exit')
        


def bless(studentName):
    clear()
    id = input("What is your id (Tehudat-Zehut)?\n")
    while hashlib.md5(id.encode()).digest() != IDS[studentName]:
      clear()
      id = input("What is your id (Tehudat-Zehut)?\n")
    clear()
    sleep(3)
    foramlSudentName = studentName[0].upper()+ studentName[1:]
    print(create_ascii_frame(BLESSINGS[studentName],foramlSudentName))
    f = open("To "+str(foramlSudentName) +".txt",'w')
    f.write(HEB_BLESS[studentName])
    f.close()
    print("'To "+foramlSudentName+".txt' file was just created, READ IT!")
    sleep(5)
    keyboard.press('f11')
    sleep(40)
    os.system('exit')



STUDENTS = {"oren":"test","daniel":"test","edo":"test","ron":"test","avi":"test","yehonatan":"test","yonatan":"test","ido":"test","itai":"test","itay":"test","shahar":"test","shachar":"test","eliya":"test","lior":"test","yarden":"test"}
try:
  bye()
  sys.stdout.flush()
  sleep(5)
  os.system('color 07')
  os.system('exit')
except KeyboardInterrupt:
  clear()
  os.system('color 07')
  print("Thank you for amazing year, bye!")
keyboard.press('f11')
sleep(2)
os.system('color 07')
sys.exit(0)

